src/cf/Documents/ПоступлениеВыбытиеЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеВыбытиеЦБ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФинансовыйРезультат</xr:Item>
				<xr:Item>AccumulationRegister.СобственныеЦБ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЦБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКомиссий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/СобственныеЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>СобственныеЦБ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переоценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Затраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКДПолученный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКДНакопленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВыбытиеЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ФинансовыйРезультат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ФинансовыйРезультат</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ВидыОперацийЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЦБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выбытие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ПоступлениеВыбытиеЦБ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Движения.СобственныеЦБ.Записывать = Истина;
	Движения.ФинансовыйРезультат.Записывать = Истина;
	Движения.СобственныеЦБ.Очистить();
	Движения.ФинансовыйРезультат.Очистить();

	Если ВидОперации = Перечисления.ВидыОперацийЦБ.Поступление Тогда
		ПровестиПоступление(Отказ);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЦБ.Выбытие Тогда
		ПровестиВыбытие(Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПровестиПоступление(Отказ)

	Движение = Движения.СобственныеЦБ.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ЦеннаяБумага = ЦеннаяБумага;
	Движение.Партия = Ссылка;
	Движение.Количество = Количество;
	Движение.Стоимость = Цена * Количество;
	Движение.НКДПолученный = НКД;
	Движение.Затраты = Комиссии.Итог("Сумма");
	Движение.Переоценка = 0;
	Движение.НКДНакопленный = 0;

КонецПроцедуры

Процедура ПровестиВыбытие(Отказ)

	// Запрос остатков по партиям для FIFO-списания
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СобственныеЦБОстатки.Партия КАК Партия,
	|	СобственныеЦБОстатки.Партия.Дата КАК ДатаПартии,
	|	СобственныеЦБОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	СобственныеЦБОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
	|	СобственныеЦБОстатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
	|	СобственныеЦБОстатки.ЗатратыОстаток КАК ЗатратыОстаток,
	|	СобственныеЦБОстатки.НКДПолученныйОстаток КАК НКДПолученныйОстаток,
	|	СобственныеЦБОстатки.НКДНакопленныйОстаток КАК НКДНакопленныйОстаток
	|ИЗ
	|	РегистрНакопления.СобственныеЦБ.Остатки(
	|		&МоментВремени,
	|		ЦеннаяБумага = &ЦеннаяБумага) КАК СобственныеЦБОстатки
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПартии,
	|	СобственныеЦБОстатки.Партия";

	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();

	// Проверка достаточности остатка
	ИтогоДоступно = ТаблицаОстатков.Итог("КоличествоОстаток");
	Если ИтогоДоступно < Количество Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Недостаточно ценных бумаг ""%1"" для списания. Доступно: %2, требуется: %3.'"),
			Строка(ЦеннаяБумага),
			ИтогоДоступно,
			Количество);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// FIFO-списание
	ОсталосьСписать = Количество;
	ИтогоСписанныхРесурсов = 0;

	Для Каждого СтрокаОстатков Из ТаблицаОстатков Цикл

		Если ОсталосьСписать = 0 Тогда
			Прервать;
		КонецЕсли;

		СписатьИзПартии = Мин(СтрокаОстатков.КоличествоОстаток, ОсталосьСписать);
		Доля = СписатьИзПартии / СтрокаОстатков.КоличествоОстаток;

		СписаннаяСтоимость = Окр(СтрокаОстатков.СтоимостьОстаток * Доля, 2);
		СписаннаяПереоценка = Окр(СтрокаОстатков.ПереоценкаОстаток * Доля, 2);
		СписанныйНКДПолученный = Окр(СтрокаОстатков.НКДПолученныйОстаток * Доля, 2);
		СписанныйНКДНакопленный = Окр(СтрокаОстатков.НКДНакопленныйОстаток * Доля, 2);
		СписанныеЗатраты = Окр(СтрокаОстатков.ЗатратыОстаток * Доля, 2);

		Движение = Движения.СобственныеЦБ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЦеннаяБумага = ЦеннаяБумага;
		Движение.Партия = СтрокаОстатков.Партия;
		Движение.Количество = СписатьИзПартии;
		Движение.Стоимость = СписаннаяСтоимость;
		Движение.Переоценка = СписаннаяПереоценка;
		Движение.НКДПолученный = СписанныйНКДПолученный;
		Движение.НКДНакопленный = СписанныйНКДНакопленный;
		Движение.Затраты = СписанныеЗатраты;

		ИтогоСписанныхРесурсов = ИтогоСписанныхРесурсов
			+ СписаннаяСтоимость
			+ СписаннаяПереоценка
			+ СписанныйНКДПолученный
			+ СписанныйНКДНакопленный
			+ СписанныеЗатраты;

		ОсталосьСписать = ОсталосьСписать - СписатьИзПартии;

	КонецЦикла;

	// Финансовый результат
	ВыручкаВыбытия = Цена * Количество + НКД - Комиссии.Итог("Сумма");

	Движение = Движения.ФинансовыйРезультат.Добавить();
	Движение.Период = Дата;
	Движение.ЦеннаяБумага = ЦеннаяБумага;
	Движение.Сумма = ВыручкаВыбытия - ИтогоСписанныхРесурсов;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
